app/controllers/chat_controller.rb

INSERT INTO "chats" ("cpk", "user", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5)  [["cpk", "1454656c-db99-4ede-a284-375a365bb006"], ["user", nil], ["message", "Lorem Ipsum"], ["created_at", "2024-05-31 15:01:54.271493"], ["updated_at", "2024-05-31 15:01:54.271493"]]
---
  def new
    @chat = Chat.create(chatParameter)

SELECT "chats".* FROM "chats"
---
  def all
    @chat = Chat.all